exercise-snappyhexmesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.01 -0.01 -0.01)
    (0.09 -0.01 -0.01)
    (0.09 0.03 -0.01)
    (-0.01 0.03 -0.01)
    (-0.01 -0.01 0.02)
    (0.09 -0.01 0.02)
    (0.09 0.03 0.02)
    (-0.01 0.03 0.02)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 16 12) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);


// ************************************************************************* //
