exercise-snappyhexmesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;
// application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.05;
// endTime         0.1;
// endTime         1000;

deltaT          0.0001;
// deltaT          1;

writeControl        adjustableRunTime;
// writeControl    timeStep;

writeInterval   0.0005;
// writeInterval   0.005;
// writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    probes
    {
        type            probes;
        libs            (sampling);
        writeControl    timeStep;
        writeInterval   10;

        fields
        (
            p
            U
        );

        probeLocations
        (
            (0.06 0.001 0.005)
            (0.06 0.003 0.005)
            (0.06 0.005 0.005)
            (0.06 0.007 0.005)
            (0.06 0.009 0.005)
            (0.06 0.011 0.005)
            (0.06 0.013 0.005)
            (0.06 0.015 0.005)
            (0.06 0.017 0.005)
            (0.06 0.019 0.005)
        );
    }

    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}


// ************************************************************************* //
